Repository: nazarioa/e-luminate-wp-standalone-theme
Catalog: languages/*.po
Languages: es

source: Standalone theme for e-luminate.
es: Tema independiente para e-luminate.

source: Archive Video Series
es: Archivos de series de video

source: Recent videos
es: Videos recientes

source: About us
es: Acerca de nosotros

source: List in
es: Encontrado en

source: Shows
es: Videos

source: Social Menu
es: Menú social

source: Popular shows
es: Videos populares

source: Shows that we may want to highlight
es: Videos que queremos destacar

source: Health
es: Salud

source: Relate with health
es: Relacionado con salud

source: Business
es: Negocio

source: Relate with business
es: Relacionado con negocio

source: Science / Technology
es: Ciencia / Tecnología

source: Relate with science and technology
es: Relacionado con ciencia y tecnologia

source: PSA / Promo
es: Anuncios y promociones

source: Promoting or providing public service announcements
es: Preveyndo anuncios y promociones al publico

source: Housing / Community
es: Alojamiento y comunidad

source: Relate with housing and community
es: Acercas de alejamiento y comunidad

source: History / Culture
es: Historia y cultura

source: Relate with history and culture
es: Relacionado con historia y cultura

source: Law / Politics / Policy
es: Derecho / Política / Polisa

source: Relate with law politics and policy
es: Relacionado con derechos, política, polisa

source: Family / Youth
es: Familia / Juventud

source: Relate with families and young adults
es: Relacionado con familias y jovenes

source: List in section
es: Encontrado en sección

# Post Type General Name
source: Video Series
es: Serie de Videos

# Post Type Singular Name
source: Video Series
es: Serie de Videos

source: Video Series
es: Serie de Videos

source: Video Series Archives
es: Archivos de Serie de Videos

source: Video Series Attributes
es: Atributos de Serie de Videos

source: All Video Series
es: Todas las Series de Videos

source: Add New Video Series
es: Añadir nueva Serie de Video

source: Add New
es: Añadir nuevo

source: New Video Series
es: Nueva Serie de Video

source: Edit Video Series
es: Editar Serie de Videos

source: Update Video Series
es: Actualizar Serie de Video

source: View Video Series
es: Ver Serie de Video

source: Sorry, no posts matched your criteria.
es: Lo sentimos, no encontramos un post que coincide con tu filtro.

source: Home
es: Inicio

source: Related topics:
es: Temas relacionados:
